; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
   room_1 room_4 - room
   red_door_1 green_door_1 - door
   grey_ball_2 - ball
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (hold_3))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_0)) (when (and (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (not (or (not (emptyhands)) (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))))) (not (hold_1))) (when (or (not (emptyhands)) (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (hold_1)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_1) (when (and (not (locked green_door_1)) (not (or (= ?obj grey_ball_2) (carrying grey_ball_2) (not (locked red_door_1))))) (not (hold_3))) (when (or (= ?obj grey_ball_2) (carrying grey_ball_2) (not (locked red_door_1))) (hold_3)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (agentinroom room_4) (not (agentinroom room_1))) (not (hold_1))) (when (agentinroom room_1) (hold_1)) (when (and (not (locked green_door_1)) (not (or (and (carrying grey_ball_2) (not (= ?obj grey_ball_2))) (not (locked red_door_1))))) (not (hold_3))) (when (or (and (carrying grey_ball_2) (not (= ?obj grey_ball_2))) (not (locked red_door_1))) (hold_3)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (hold_2)) (when (and (not (or (and (not (locked ?door)) (= ?door green_door_1)) (and (locked green_door_1) (not (and (locked ?door) (= ?door green_door_1)))))) (not (or (carrying grey_ball_2) (not (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1))))))))) (not (hold_3))) (when (or (carrying grey_ball_2) (not (or (and (not (locked ?door)) (= ?door red_door_1)) (and (locked red_door_1) (not (and (locked ?door) (= ?door red_door_1))))))) (hold_3)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 room_3 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   grey_door_1 grey_door_2 - door
   blue_box_1 yellow_box_1 grey_box_1 green_box_1 red_box_1 green_box_2 - box
   grey_ball_1 - ball
 )
 (:init (agentinroom room_4) (objectinroom grey_ball_1 room_1) (objectinroom green_box_1 room_1) (objectinroom red_box_1 room_2) (objectinroom grey_ball_2 room_2) (objectinroom blue_box_1 room_3) (objectinroom grey_box_1 room_3) (objectinroom green_box_2 room_3) (objectinroom yellow_box_1 room_4) (objectcolor grey_ball_1 greytype) (objectcolor green_box_1 greentype) (objectcolor red_box_1 redtype) (objectcolor grey_ball_2 greytype) (objectcolor blue_box_1 bluetype) (objectcolor grey_box_1 greytype) (objectcolor green_box_2 greentype) (objectcolor yellow_box_1 yellowtype) (objectcolor grey_door_1 greytype) (objectcolor grey_door_2 greytype) (objectcolor green_door_1 greentype) (objectcolor red_door_1 redtype) (emptyhands) (locked grey_door_1) (locked grey_door_2) (locked green_door_1) (locked red_door_1) (adjacentrooms room_2 room_1 grey_door_1) (adjacentrooms room_1 room_2 grey_door_1) (adjacentrooms room_3 room_1 grey_door_2) (adjacentrooms room_1 room_3 grey_door_2) (adjacentrooms room_4 room_2 green_door_1) (adjacentrooms room_2 room_4 green_door_1) (adjacentrooms room_4 room_3 red_door_1) (adjacentrooms room_3 room_4 red_door_1) (visited room_4) (hold_0) (hold_3) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greytype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2) (hold_3)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor green_door_1 room_4 room_2)
   added: (at_ green_door_1)
   goals met: 2 of 5
2. (toggle green_door_1)
   deleted: (locked green_door_1) (hold_3)
   added: (hold_2)
   goals met: 2 of 5
3. (gotoroom room_4 room_2 green_door_1)
   deleted: (agentinroom room_4) (at_ green_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 2 of 5
4. (gotoobject grey_ball_2 room_2)
   added: (at_ grey_ball_2)
   goals met: 2 of 5
5. (pick grey_ball_2 room_2)
   deleted: (at_ grey_ball_2) (emptyhands) (objectinroom grey_ball_2 room_2)
   added: (carrying grey_ball_2) (hold_1) (hold_3)
   goals met: 4 of 5
6. (gotodoor grey_door_1 room_2 room_1)
   added: (at_ grey_door_1)
   goals met: 4 of 5
7. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 5 of 5
